notes-md/20250111131854-python_list.md

# Table of Contents

1.  [Syntax](#orgcd50cda)
    1.  [Create and initialize a list](#org770db10)
    2.  [Create a list without initialize it](#org44e921d)
2.  [Characteristics](#org48d1d8a)
3.  [Methods](#orgbb2edf2)
    1.  [append()](#orga4b9fe0)
        1.  [Use cases](#org1ba213e)
4.  [Tools](#orgbf04eb3)
    1.  [Iterate a list](#orgd8d89dd)
        1.  [Use cases](#orgd53fd28)
    2.  [Acces elements in a list](#orgbcc8a6f)
        1.  [Use cases](#orgb41c36c)
5.  [Questions](#orge91fc46)
    1.  [Do the for loop create a copy for every element in a list during the iteration?](#orgbd2cff8)
6.  [See Also](#orgdc8aa0b)



<a id="orgcd50cda"></a>

# Syntax

To use a list in Python you just use this syntax


<a id="org770db10"></a>

## Create and initialize a list

    example_list=[1,2,3,4]

With this syntax you can create and initialize a list. In this case we create the list "list<sub>example</sub>" and intialize it with the values "1,2,3,4"


<a id="org44e921d"></a>

## Create a list without initialize it

    example_list=[]

With this syntax we just create a list called "list<sub>example</sub>", but it is empty, we can save data later with some methods, especifically the methods **append()** and \*j


<a id="org48d1d8a"></a>

# Characteristics

-   It saves the order of the elements
-   It is mutable


<a id="orgbb2edf2"></a>

# Methods


<a id="orga4b9fe0"></a>

## append()

It add an elment at the end of a list


<a id="org1ba213e"></a>

### Use cases

1.  Save user entry information

    Let say we want to save some items that our user want to save, so our code will look something like this
    
        things_to_remenber = [] #We start with an empty list because we don't know what we'll like to remember
        continue = true #Helping variable to control the loop
        while continue:
            thing = input("What do you want me to remember?: ") #We ask the user 
            things_to_remember.append(thing) #We add the thing at the end of the list
            if(input("Do you want to continue [y/n]?: ").lower == "n"):
                continue = false
        
        for _ in things_to_remember:
            print(_)
    
    With this code we will save things in a list and at the end we will print them.


<a id="orgbf04eb3"></a>

# Tools


<a id="orgd8d89dd"></a>

## Iterate a list

To iterate a list we can use the for loop in the next way:

    list_example = [1,2,3,4]
    for _ in list_example:
        <code>

In this code the "\\\_" is the variable in which the element of the list is saved. In the first cycle the variable "\\\_" will save the value "1", in the second cycle will be 2 and so on. Remember that "\_" is just the name of a variable so it will be the same as:

    name=["Marcus", "Paul", "Jaremy"]
    for name in names:
        <code>


<a id="orgd53fd28"></a>

### Use cases

1.  Printing a list

    The most common use of iterating a list with a for loop is printing it, for example in the case of the names
    
        name=["Marcus", "Paul", "Jaremy"]
        for name in names:
            print(name)


<a id="orgbcc8a6f"></a>

## Acces elements in a list

To acces elements in a list we use the syntax:
`<list name>[index]`

**Remember**: The index of the first element of a list is *0*


<a id="orgb41c36c"></a>

### Use cases

1.  Print the value store in a specific index

        lst_example = [1,"Hola", True, 4]
        print(lst_example[1])
    
    This will print `Hola`

2.  Replace the value in an specific index

    To replace a the value of one index we do this:
    
        lst_example = [1, "Hola", True, 4]
        lst_example[1] = "Hello"
        print(lst_example)
    
    This will print `[1, 'Hello', True, 4]"`

3.  Change all the values in a list

    For this we also use the function len()
    
        lst_example = [1,2,3,4]
        for i in range(len(lst_example)):
            lst_example[i] += 1
        
        print(lst_example)
    
    Inside the for loop we add 1 to all the values in the list and obtain the next result `[2, 3, 4, 5]`


<a id="orge91fc46"></a>

# Questions


<a id="orgbd2cff8"></a>

## Do the for loop create a copy for every element in a list during the iteration?

No, the for loop doesn't not create a copy, the loop variable is a reference to the values of the list. So, any alteration to the value to which the variable is referencing will alter the values of the list. To see this we can use the next code:

    lists = [[1,2,3], [4,5,6], [7,8,9]]
    for lst in lists:
        lst.pop()
    
    print(lists)

**Output**

    [[1, 2], [4, 5], [7, 8]]

We can see that the modifications to each list of lists done inside the for loop is done to the lists inside lists. <del>sounds like a tongue twister xd</del>

But if we do an assingment operation to the loop variable it wont affect the value of the list because we will be changing the reference stores in the variable. For example, this code:

    lst_example = [1,2,3,4]
    for _ in lst_example:
        _+=1
    
    print(lst_example)

produce this output:

    [1, 2, 3, 4]

This is because the `_+=1` statement acts like an assignment, this assignment `_ = _ + 1`


<a id="orgdc8aa0b"></a>

# See Also

